--------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  H:\FTSE_Terror.log
  log type:  text
 opened on:  26 Nov 2017, 16:37:50

. 
. use "D:\EME Data\Clean Data\Python_to_Stata_FTSE_Terror.dta"

. 
. gen Date2 = dofc(Date)

. 
. format Date2 %td

. 
. tsset Date2
        time variable:  Date2, 30dec1983 to 24nov2017, but with gaps
                delta:  1 day

. 
. reg D_FTSE D_SP propvalue nwound nkill, robust nocon

Linear regression                               Number of obs     =      8,845
                                                F(3, 8841)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1793
                                                Root MSE          =     .00977

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        D_SP |   .3651678   .0168665    21.65   0.000     .3321056    .3982301
   propvalue |   1.81e-11   1.76e-12    10.24   0.000     1.46e-11    2.15e-11
      nwound |  -.0000232   4.27e-06    -5.44   0.000    -.0000316   -.0000149
       nkill |  -9.97e-06   7.61e-06    -1.31   0.190    -.0000249    4.95e-06
------------------------------------------------------------------------------

. reg D_FTSE D_SP propvalue L.propvalue nwound nkill , robust nocon

Linear regression                               Number of obs     =      7,076
                                                F(3, 7071)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1550
                                                Root MSE          =      .0097

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        D_SP |    .339688   .0188649    18.01   0.000      .302707    .3766689
             |
   propvalue |
         --. |   1.95e-11   1.46e-13   134.10   0.000     1.92e-11    1.98e-11
         L1. |  -2.04e-13   1.93e-13    -1.06   0.290    -5.82e-13    1.74e-13
             |
      nwound |  -.0000204   3.76e-06    -5.42   0.000    -.0000278    -.000013
       nkill |  -4.53e-06   4.80e-06    -0.94   0.345    -.0000139    4.88e-06
------------------------------------------------------------------------------

. reg D_FTSE D_SP propvalue L.propvalue nwound L.nwound ///
>         nkill L.nkill , robust nocon

Linear regression                               Number of obs     =      7,076
                                                F(5, 7069)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1552
                                                Root MSE          =      .0097

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        D_SP |   .3394155   .0188703    17.99   0.000     .3024241     .376407
             |
   propvalue |
         --. |   1.95e-11   1.45e-13   134.28   0.000     1.92e-11    1.98e-11
         L1. |  -3.53e-12   1.69e-12    -2.09   0.037    -6.85e-12   -2.22e-13
             |
      nwound |
         --. |  -.0000204   3.76e-06    -5.43   0.000    -.0000278    -.000013
         L1. |   .0000179   9.08e-06     1.97   0.048     1.28e-07    .0000357
             |
       nkill |
         --. |  -4.59e-06   4.78e-06    -0.96   0.337     -.000014    4.78e-06
         L1. |  -5.31e-06   9.24e-06    -0.57   0.566    -.0000234    .0000128
------------------------------------------------------------------------------

. 
. reg D_FTSE D_SP propvalue L.propvalue L.L.propvalue ///
>         nkill L.nkill L.L.nkill ///
>         nwound L.nwound L.L.nwound , robust nocon

Linear regression                               Number of obs     =      5,307
                                                F(8, 5297)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.1703
                                                Root MSE          =     .00954

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        D_SP |   .3551226   .0198667    17.88   0.000     .3161756    .3940696
             |
   propvalue |
         --. |   1.94e-11   1.43e-13   136.22   0.000     1.92e-11    1.97e-11
         L1. |  -7.80e-11   4.67e-10    -0.17   0.867    -9.93e-10    8.37e-10
         L2. |  -8.76e-12   5.31e-12    -1.65   0.099    -1.92e-11    1.66e-12
             |
       nkill |
         --. |  -8.24e-06   4.78e-06    -1.72   0.085    -.0000176    1.13e-06
         L1. |  -.0000161   5.88e-06    -2.74   0.006    -.0000276   -4.60e-06
         L2. |   .0000144   8.85e-06     1.63   0.104    -2.97e-06    .0000317
             |
      nwound |
         --. |  -.0000196   3.61e-06    -5.43   0.000    -.0000267   -.0000125
         L1. |   .0000113   2.27e-06     4.98   0.000     6.84e-06    .0000157
         L2. |   .0000453   .0000284     1.59   0.111    -.0000104     .000101
------------------------------------------------------------------------------

. 
. reg D_FTSE  propvalue L.propvalue L.L.propvalue ///
>         nkill L.nkill L.L.nkill ///
>         nwound L.nwound L.L.nwound , robust nocon

Linear regression                               Number of obs     =      5,307
                                                F(7, 5298)        =          .
                                                Prob > F          =          .
                                                R-squared         =     0.0062
                                                Root MSE          =     .01044

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
   propvalue |
         --. |   2.06e-11   1.46e-13   141.77   0.000     2.03e-11    2.09e-11
         L1. |   2.10e-10   5.35e-10     0.39   0.695    -8.39e-10    1.26e-09
         L2. |  -1.06e-11   6.35e-12    -1.66   0.096    -2.30e-11    1.88e-12
             |
       nkill |
         --. |  -9.56e-06   4.44e-06    -2.15   0.031    -.0000183   -8.58e-07
         L1. |  -.0000118   4.92e-06    -2.40   0.017    -.0000215   -2.15e-06
         L2. |   .0000181   8.51e-06     2.13   0.033     1.46e-06    .0000348
             |
      nwound |
         --. |  -.0000135   4.06e-06    -3.32   0.001    -.0000214   -5.53e-06
         L1. |   .0000173   2.46e-06     7.03   0.000     .0000124    .0000221
         L2. |   .0000566   .0000336     1.68   0.092    -9.27e-06    .0001225
------------------------------------------------------------------------------

.  
. reg D_FTSE D_SP L.D_SP L.L.D_SP ///
>  propvalue L.propvalue L.L.propvalue ///
>         nkill L.nkill L.L.nkill ///
>         nwound L.nwound L.L.nwound , robust nocon 

Linear regression                               Number of obs     =      5,307
                                                F(10, 5295)       =          .
                                                Prob > F          =          .
                                                R-squared         =     0.2457
                                                Root MSE          =      .0091

------------------------------------------------------------------------------
             |               Robust
      D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
        D_SP |
         --. |   .3629769   .0173748    20.89   0.000      .328915    .3970387
         L1. |   .2347104    .020727    11.32   0.000      .194077    .2753438
         L2. |  -.0154574   .0169812    -0.91   0.363    -.0487475    .0178328
             |
   propvalue |
         --. |   1.87e-11   1.70e-13   109.95   0.000     1.84e-11    1.91e-11
         L1. |   1.23e-10   4.90e-10     0.25   0.802    -8.37e-10    1.08e-09
         L2. |  -6.27e-12   5.63e-12    -1.11   0.266    -1.73e-11    4.77e-12
             |
       nkill |
         --. |  -.0000134   5.27e-06    -2.55   0.011    -.0000238   -3.10e-06
         L1. |  -.0000135   6.64e-06    -2.03   0.043    -.0000265   -4.43e-07
         L2. |   .0000102   7.76e-06     1.31   0.191    -5.05e-06    .0000254
             |
      nwound |
         --. |  -.0000159   3.78e-06    -4.21   0.000    -.0000233   -8.52e-06
         L1. |   6.85e-06   2.45e-06     2.79   0.005     2.05e-06    .0000117
         L2. |   .0000356     .00003     1.18   0.236    -.0000233    .0000945
------------------------------------------------------------------------------

.  
.  
.  
.  dfuller logFTSE, nocon reg

Dickey-Fuller test for unit root                   Number of obs   =      7076

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)              2.666            -2.580            -1.950            -1.620

------------------------------------------------------------------------------
   D.logFTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
     logFTSE |
         L1. |   .0000403   .0000151     2.67   0.008     .0000107      .00007
------------------------------------------------------------------------------

.  dfuller D_FTSE, nocon reg

Dickey-Fuller test for unit root                   Number of obs   =      7076

                               ---------- Interpolated Dickey-Fuller ---------
                  Test         1% Critical       5% Critical      10% Critical
               Statistic           Value             Value             Value
------------------------------------------------------------------------------
 Z(t)            -87.014            -2.580            -1.950            -1.620

------------------------------------------------------------------------------
    D.D_FTSE |      Coef.   Std. Err.      t    P>|t|     [95% Conf. Interval]
-------------+----------------------------------------------------------------
      D_FTSE |
         L1. |  -1.003286   .0115302   -87.01   0.000    -1.025888    -.980683
------------------------------------------------------------------------------

. log close
      name:  <unnamed>
       log:  H:\FTSE_Terror.log
  log type:  text
 closed on:  26 Nov 2017, 16:37:51
--------------------------------------------------------------------------------------------------
